Revit 2026 API

# NumericRevisionSettings Constructor

---

Constructs a NumericRevisionSettings with a simple, default numbering sequence.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public NumericRevisionSettings()
```
```vb
Public Sub New
```
```cpp
public:
NumericRevisionSettings()
```
```fsharp
new : unit -> NumericRevisionSettings
```

Initializes startNumber to 1. The prefix and suffix strings are set to empty.

#### Reference

NumericRevisionSettings Class

NumericRevisionSettings Overload

Autodesk.Revit.DB Namespace